{
  "sessions": [
    
    
    {
      "id": 1,
      "title": "Introduction to commercetools Platform",
      "overview": "This session introduces commercetools concepts, capabilities, and key resources. You will set up projects and explore essential tools like the Merchant Center.",
      "infographic": "",
      "keyDecisions": [
        {
          "decisionId": 1,
          "title": "Public Beta Features",
          "scenario": "<b>EcoLiving</b> is evaluating a new Public Beta Feature (Multiple Customer Group Assignment) for its loyalty campaign.",
          "options": [
            {
              "text": "<b>Evaluate in staging:</b> Test thoroughly before production.",
              "isCorrect": false,
              "feedback": "While rigorous staging testing lowers risk, it might delay benefits. Consider a gradual production rollout for a quicker market response."
            },
            {
              "text": "<b>Start gradually in production:</b> Roll out with limited scope and close monitoring.",
              "isCorrect": true,
              "feedback": "Correct. This approach balances speed and risk, gathering timely feedback and allowing agile adjustments."
            },
            {
              "text": "<b>Wait for GA:</b> Delay until the feature is generally available.",
              "isCorrect": false,
              "feedback": "Although waiting for GA ensures stability, it may slow innovation. A gradual rollout with controlled monitoring typically offers a better balance."
            }
          ],
          "status": "Not Started"
        },
        {
          "decisionId": 2,
          "title": "Limits",
          "scenario": "<b>EcoLiving</b> is nearing the 10,000-category limit due to heavy use of product categories. How should they increase the limit?",
          "options": [
            {
              "text": "Submit a support request to boost the limit.",
              "isCorrect": true,
              "feedback": "Correct. Officially raising the limit aligns with best practices and ensures scalability without complicating your data structure."
            },
            {
              "text": "Reorganize into subcategories or adjust attributes.",
              "isCorrect": false,
              "feedback": "While this might temporarily ease the strain, it doesn't actually expand capacity and may overcomplicate your structure."
            },
            {
              "text": "Use custom fields to simulate extra categories.",
              "isCorrect": false,
              "feedback": "A workaround at best; it doesn’t truly increase the limit. Pursuing an official limit increase is advisable."
            }
          ],
          "status": "Not Started"
        },
        {
          "decisionId": 3,
          "title": "Organization & Project Setup",
          "scenario": "<b>EcoLiving</b> must determine the optimal DEV and PROD setup.",
          "options": [
            {
              "text": "Same organization, separate projects.",
              "isCorrect": false,
              "feedback": "Central management is convenient but may not provide enough production isolation."
            },
            {
              "text": "Isolate PROD in its own organization.",
              "isCorrect": true,
              "feedback": "Correct. Separating PROD into its own organization enhances security and risk mitigation per best practices."
            },
            {
              "text": "Single project; publish products & other data only when production-ready.",
              "isCorrect": false,
              "feedback": "This approach blurs DEV/PROD boundaries, increasing risks. Isolation offers better operational safety."
            }
          ],
          "status": "Not Started"
        }
      ],
      "quiz": "https://learn.commercetools.com/mod/quiz/view.php?id=1384",
      "case_studies": [],
      "recommendations": [
        {
          "title": "Overview of commercetools Platform",
          "link": "https://docs.commercetools.com/offering/products-overview"
        },
        {
          "title": "Understanding commercetools APIs",
          "link": "https://docs.commercetools.com/api/"
        },
        {
          "title": "Platform Limits and Compatibility",
          "link": "https://docs.commercetools.com/api/limits"
        },
        {
          "title": "Merchant Center Overview",
          "link": "https://docs.commercetools.com/merchant-center"
        }
      ]
    }
    ,
    


    {
      "id": 2,
      "title": "Product Modeling Basics",
      "overview": "This session covers setting up the commercetools project, creating a customer in Merchant Center, and the basics of product modeling: product types, attributes, and variants.",
      "infographic": "",
      "keyDecisions": [
        {
          "decisionId": 4,
          "title": "Product Modeling",
          "scenario": "<b>EcoLiving</b> launches the 'Maya Pillow Cover' available in various colors and materials.",
          "options": [
            {
              "text": "<b>Use multiple product variants</b>: Manage variants as per different colors/materials efficiently within a single product.",
              "isCorrect": true,
              "feedback": "Correct: Using product variants streamlines management by grouping different attributes under one product, ensuring consistency and efficient operations."
            },
            {
              "text": "<b>Separate Products</b>: Create standalone products for clear individual SEO and marketing.",
              "isCorrect": false,
              "feedback": "Although separate products might boost SEO, they lead to redundancy and complicate inventory management. Consider using product variants for a cohesive strategy if it stays withing the limits."
            },
            {
              "text": "<b>Hybrid Approach</b>: Create Variants by color in one product and create another separat product with variants by material to optimize discoverability.",
              "isCorrect": false,
              "feedback": "Could be overcomplicated: While hybrid strategies sound flexible, they might add unnecessary complexity. A unified product variant approach is usually recommended within the limits or consider creating separate products"
            }
          ],
          "status": "Not Started"
        },
        {
          "decisionId": 5,
          "title": "Product Configuration",
          "scenario": "EcoLiving needs rich, multilingual product specifications and descriptions in different locales.",
          "options": [
            {
              "text": "Use <b>LocalizedText</b> to provide clear, detailed, and localized product descriptions.",
              "isCorrect": true,
              "feedback": "Correct: LocalizedText fields deliver the needed detail in multiple languages, making product descriptions clear even if they aren’t optimized for filtering."
            },
            {
              "text": "Use <b>Multilingual Text Field attributes</b> to offer language-specific content.",
              "isCorrect": false,
              "feedback": "Consider this: While multilingual fields  might work, using dedicated LocalizedText ensures consistency and better integration for detailed content."
            },
            {
              "text": "<b>Structured Filterable Attributes</b>: Focus on attributes optimized for filtering rather than detailed description.",
              "isCorrect": false,
              "feedback": "Not optimal: Filterable attributes are great for search but fall short on conveying the full descriptive detail in different locales needed for rich product content."
            }
          ],
          "status": "Not Started"
        },
        
        {
          "decisionId": 6,
          "title": "Choosing the Correct Identifier",
          "scenario": "EcoLiving must decide which identifier to use for stable integrations and efficient querying.",
          "options": [
            {
              "text": "Use <b>ID</b>s which are automatically generated for each resource",
              "isCorrect": false,
              "feedback": "Avoid this: System-generated IDs are not designed for external integrations. Rely on them only for internal tracking."
            },
            {
              "text": "Use <b>Key</b> to have meaningful, readable to have stable code integrations.",
              "isCorrect": true,
              "feedback": "Correct: The key is the recommended identifier for stable external references and integrations due to its clarity and adaptability."
            },
            {
              "text": "Use <b>SKU</b>",
              "isCorrect": false,
              "feedback": "Not the best choice: While SKU is vital for stock management, it isn’t suited as a primary code reference. Use it only for inventory purposes."
            },
            {
              "text": "Use <b>Slug</b> to have SEO-friendly URLs and SEO",
              "isCorrect": false,
              "feedback": "Not ideal: Slugs are perfect for user-friendly URLs for products / categories only, not for stable integration."
            }
          ],
          "status": "Not Started"
        }
      ],
      "quiz": "https://learn.commercetools.com/mod/quiz/view.php?id=1386",
      "case_studies": [
        {
          "title": "Case Study 1: Product Modeling",
          "link": "https://docs.google.com/document/d/1EikDjb77fWfWYe55pUnY1Ss-bPtdZNgl/edit",
          "description": [
            {
              "type": "paragraph",
              "content": "<b>AllForFoodies</b> plans to launch online cooking classes using an integrated product model."
            },
            {
              "type": "paragraph",
              "content": "commercetools acts as a PIM and Order Management System."
            },
            {
              "type": "list",
              "content": [
                "Online French cooking class, $39.99",
                "Online Italian cooking class, $39.99",
                "Online Middle Eastern cooking class, $39.99",
                "Online Soup cooking class, $25.99",
                "Online Grilling class, $22.99"
              ]
            },
            {
              "type": "paragraph",
              "content": "Create a product model using a product type ‘Online Offering’ and associated variants."
            },
            {
              "type": "paragraph",
              "content": "Draft your solution in the Notes field with your team."
            }
          ]
        }
      ],
      "recommendations": [
        {
          "title": "Merchant Center Guide",
          "link": "https://docs.commercetools.com/merchant-center/"
        },
        {
          "title": "Product Modeling Overview",
          "link": "https://docs.commercetools.com/learning-model-your-product-catalog/product-modeling/overview"
        }
      ]
    }
    ,




    {
      "id": 3,
      "title": "Advanced Product Modeling",
      "overview": "This session dives deeper into product modeling strategies and effective promotion tactics to enhance commerce performance.",
      "infographic": "",
      "keyDecisions": [
        {
          "decisionId": 7,
          "title": "Dynamic Recommendations Strategy",
          "scenario": "<b>EcoLiving</b> plans dynamic recommendations between products like 'Edgar Armchair' and 'Silky Pillow Cover'. Which strategy do you prefer?",
          "options": [
            {
              "text": "<b>Product Reference Attributes:</b> Direct, explicit links for curation.",
              "isCorrect": true,
              "feedback": "Correct. This approach ensures precise, manual curation. Consider this optimal method for reliable recommendations."
            },
            {
              "text": "<b>Attribute-based Lookup:</b> Store the recommended SKU/ID in a custom field and fetch via API.",
              "isCorrect": false,
              "feedback": "Not ideal. Think about how explicit linking minimizes extra API calls and inconsistency. Consider the recommended reference attributes instead."
            },
            {
              "text": "<b>Category Matching:</b> Use same-category filtering for dynamic recommendations.",
              "isCorrect": false,
              "feedback": "Less precise. Reflect on how using categories alone might retrieve unrelated products. Consider explicit product references for higher accuracy."
            }
          ],
          "status": "Not Started"
        },
        {
          "decisionId": 8,
          "title": "Seasonal Category Management",
          "scenario": "<b>EcoLiving</b> frequently updates its seasonal collections. Which category management approach best suits this need?",
          "options": [
            {
              "text": "<b>Season-based Parent Categories:</b> Use top-level seasonal categories (e.g., Summer, Winter).",
              "isCorrect": true,
              "feedback": "Correct. This straightforward method provides clarity. Consider this optimal approach for managing seasonal changes."
            },
            {
              "text": "<b>Attribute-based Dynamic Categories:</b> Auto-assign products using seasonal attributes.",
              "isCorrect": false,
              "feedback": "Automated but less controlled. Think about the benefits of clear, top-level seasonal categories instead."
            },
            {
              "text": "<b>Combined Hierarchy and Attributes:</b> Mix static categories for SEO with dynamic attributes.",
              "isCorrect": false,
              "feedback": "This adds complexity. Reflect on how a simpler season-based approach might work better."
            }
          ],
          "status": "Not Started"
        },
        {
          "decisionId": 9,
          "title": "Product Bundling",
          "scenario": "<b>EcoLiving</b> offers multiple products bundled with discounted prices to boost sales, but bundling isn’t natively supported. How should these be modeled?",
          "options": [
            {
              "text": "<b>Use Reference Attributes</b>: Link items via reference attributes.",
              "isCorrect": true,
              "feedback": "Correct. This method provides flexible, scalable linking between products. Consider this approach as the best option."
            },
            {
              "text": "<b>Implement Cart-Level Logic:</b> Add bundled items as a gift line item or apply discount logic at the cart level.",
              "isCorrect": false,
              "feedback": "Not ideal. Cart-level logic may introduce complexity with extra rules and may be less consistent than explicit references."
            },
            {
              "text": "<b>Same-Category Discounting:</b> Configure products in the same category and use cart discounts for items within that category.",
              "isCorrect": false,
              "feedback": "Less precise. Reflect on how this approach may rely too much on category membership, which can lead to less targeted recommendations. Consider explicit linking instead."
            }
          ],
          "status": "Not Started"
        }
      ],
      "quiz": "https://learn.commercetools.com/mod/quiz/view.php?id=???",
      "case_studies": [],
      "recommendations": [
        {
          "title": "Advanced Product Modeling Techniques",
          "link": "https://docs.commercetools.com/learning-model-your-product-catalog/product-modeling/advanced"
        },
        {
          "title": "Effective Promotions and Discounts",
          "link": "https://docs.commercetools.com/discounts"
        }
      ]
    },



    {
      "id": 4,
      "title": "Stores and Channels",
      "overview": "This session focuses on pricing strategies, product selections, supply channel configuration, and tailoring product offerings for different regions.",
      "infographic": "",
      "keyDecisions": [
        {
          "decisionId": 10,
          "title": "Regional Pricing Strategy",
          "scenario": "<b>EcoLiving</b> is expanding in APAC—launching in Australia (AUD), Japan (JPY), and Singapore (SGD). Which pricing channel strategy best fits these diverse markets?",
          "options": [
            {
              "text": "<b>Single Channel, Multiple Currencies:</b> Use one pricing channel (e.g., <code>apac-price-channel</code>) and configure it with multiple currency prices (e.g., <code>apac-price-channel</code> +  AUD / JPY / SGD ).",
              "isCorrect": false,
              "feedback": "While a single channel simplifies management, it may not provide sufficient control for market-specific pricing nuances. Consider a method that allows country-level differentiation."
            },
            {
              "text": "<b>Single Channel with Price per Country:</b> Use one regional pricing channel (e.g., <code>apac-price-channel</code>) and define distinct prices for each country (e.g., set a specific AUD price for Australia, JPY for Japan, and SGD for Singapore).",
              "isCorrect": true,
              "feedback": "Correct. This approach offers clear, country-specific control within a single channel, ensuring that each market’s pricing is tailored appropriately. Consider this optimal for handling diverse currencies and regional pricing dynamics."
            },
            {
              "text": "<b>Mixed (Hybrid):</b> Combine a common channel with fallback prices for most markets, plus dedicated channels for selected regions (e.g., Australia could have a dedicated channel with both AUD and USD prices).",
              "isCorrect": false,
              "feedback": "This strategy introduces extra complexity and might be hard to manage. Reflect on how a single channel with country-specific pricing usually provides the right balance of simplicity and control."
            }
          ],
          "status": "Not Started"
        }
        ,
        {
          "decisionId": 11,
          "title": "Product Selections",
          "scenario": "<b>EcoLiving</b> manages exclusive regional product availability (e.g., for EU, APAC, UA). Which strategy best delineates regional catalogs?",
          "options": [
            {
              "text": "<b>Inclusion-based Selections:</b> Explicitly define which products are available per region.",
              "isCorrect": true,
              "feedback": "Correct. This approach clearly outlines product availability for each region. Consider this the most straightforward method."
            },
            {
              "text": "<b>Exclusion-based Selections:</b> Offer global availability with specific regional exclusions.",
              "isCorrect": false,
              "feedback": "Not ideal. Reflect on how exclusions can be ambiguous, leading to inconsistencies. Consider explicit inclusion instead."
            },
            {
              "text": "<b>Combined Inclusion-Exclusion:</b> Global core catalog with explicit regional exclusions.",
              "isCorrect": false,
              "feedback": "Overly complex. Think about the benefits of a simple, clear inclusion-based approach for predictable regional availability."
            }
          ],
          "status": "Not Started"
        },
        {
          "decisionId": 12,
          "title": "Supply Channel Configuration",
          "scenario": "For example, <b>EcoLiving</b> sources products from different warehouses to serve the APAC market. How should the supply channel be configured for accurate inventory tracking?",
          "options": [
            {
              "text": "<b>Dedicated Supply Channel per Warehouse:</b> Assign a specific channel for each warehouse.",
              "isCorrect": true,
              "feedback": "Correct. This method provides clear and direct tracking for each warehouse. Consider this approach for precise inventory management."
            },
            {
              "text": "<b>Centralized Supply Channel:</b> Use a single channel for all warehouses with fallback logic.",
              "isCorrect": false,
              "feedback": "Not ideal. Think about how a centralized channel can blur distinctions between warehouses, reducing tracking accuracy."
            },
            {
              "text": "<b>Dynamic Supply Mapping:</b> Auto-map products to warehouses using custom logic.",
              "isCorrect": false,
              "feedback": "Reflect on how dynamic mapping might introduce complexity & need for custom logic to map to nearest warehouse. Consider the clarity of dedicated channels."
            }
          ],
          "status": "Not Started"
        },
        {
          "decisionId": 13,
          "title": "Product Tailoring for Regional Stores",
          "scenario": "<b>EcoLiving</b> wants products tailored differently in each regional store. How can tailored content be best achieved?",
          "options": [
            {
              "text": "<b>Same Product, Tailored Presentation:</b> Use built-in product tailoring to adjust name, description, and images per region.",
              "isCorrect": true,
              "feedback": "Correct. This approach leverages a single product with region-specific presentation, ensuring consistency and efficiency. Consider this optimal for maintaining centralized data with localized appeal."
            },
            {
              "text": "<b>Create Separate Products:</b> Develop distinct products per region and assign them using product selections.",
              "isCorrect": false,
              "feedback": "Not ideal. Think about how creating separate products increases duplication and complexity. Reflect on the benefits of tailoring a single product."
            },
            {
              "text": "<b>Attribute-Based Tailoring:</b> Use product attributes for regional variations and display only relevant ones.",
              "isCorrect": false,
              "feedback": "Less effective. Reflect on how this method might not provide the full customization needed. Consider the tailored presentation of a single product for better control."
            }
          ],
          "status": "Not Started"
        }
      ],
      "quiz": "https://learn.commercetools.com/mod/quiz/view.php?id=1390",
      "case_studies": [],
      "recommendations": [
        {
          "title": "Merchant Center Guide",
          "link": "https://docs.commercetools.com/merchant-center/"
        },
        {
          "title": "Product Modeling Overview",
          "link": "https://docs.commercetools.com/learning-model-your-product-catalog/product-modeling/overview"
        }
      ]
    }
    

    

    









    




    ,{
      "id": "",
      "title": "",
      "overview": "",
      "infographic": "",
      "tasks": [
      ],
      "quiz": "",
      "case_studies": [
      ],
      "recommendations": [
      ]
    }















  ]
}
