{
  "sessions": [
    {
      "id": 1,
      "title": "Introduction to commercetools and Merchant Center",
      "overview": "This session provides a comprehensive introduction to commercetools and its API-first, headless commerce architecture. You'll learn about the company's vision, products, and services such as Composable Commerce, Frontend, Connect, and Checkout. Additionally, the session covers key concepts of commercetools' documentation, including JSON representations and update patterns. You’ll also explore the Merchant Center interface and set up your first organization and project.",
      "infographic": "img/session1-infographic.png",
      "topics": [
        {
          "title": "Commercetools Platform Overview",
          "description": "commercetools provides a cloud-native, composable commerce platform with three independent layers: the Presentation Layer for frontend flexibility, the Application Layer with modular commerce services, and the Platform Layer for scalable infrastructure. This architecture enables rapid deployment, omnichannel experiences, and lower operational costs.",
          "infographic": "img/platform-overview.png",
          "notes": [
            "<b>Composable Architecture</b>: Decoupled presentation, application, and platform layers for flexibility.",
            "<b>Scalability & Performance</b>: Cloud-native foundation ensures high availability and rapid scaling.",
            "<b>Omnichannel Support</b>: Solutions like InStore unify online and offline shopping experiences."
          ]
        },
        {
          "title": "Compatibility, Release Notes and Limits",
          "description": "commercetools continuously deploys updates multiple times daily without requiring manual upgrades. API evolution is designed for minimal disruption, with backward compatibility and advance notice for breaking changes for beta features. The platform also enforces a few resource limits to ensure stability.",
          "infographic": "img/compatibility.png",
          "notes": [
            "<b>Versionless API</b>: No forced upgrades; APIs evolve seamlessly.",
            "<b>Release Life Cycle</b>: Updates move from Early Access → Public Beta → General Availability with clear deprecation timelines.",
            "<b>Platform Limits</b>: Ensure optimal system performance and scalability."
          ]
        },
        {
          "title": "Touchpoints",
          "description": "commercetools offers extensive documentation, learning resources, and support for developers, ensuring seamless integration and implementation. The commercetools ecosystem includes developer guides, API references, a learning portal, and a marketplace for extensions.",
          "infographic": "img/touchpoints.png",
          "notes": [
            "<b>Documentation & Guides</b>: commercetools Documentation.",
            "<b>Developer Community & Code Samples</b>: GitHub Repository.",
            "<b>Learning Portal</b>: Learn commercetools.",
            "<b>Support & Help Desk</b>: commercetools Support.",
            "<b>Marketplace for Integrations</b>: commercetools Marketplace."
          ]
        },
        {
          "title": "Merchant Center Overview",
          "description": "The Merchant Center is commercetools' web-based interface that enables businesses to manage their e-commerce operations efficiently. It provides tools for configuring products, orders, customers, pricing, and permissions, offering full control over commercetools projects with an intuitive UI.",
          "infographic": "img/merchant-center.png",
          "notes": [
            "<b>Centralized Management</b>: Configure products, orders, customers, and pricing in a single interface.",
            "<b>Role-Based Access</b>: Assign user roles and permissions to control access.",
            "<b>Seamless API Integration</b>: Changes in the Merchant Center reflect instantly in the commercetools platform."
          ]
        }
      ],
      "quiz": "https://learn.commercetools.com/mod/quiz/view.php?id=1384",
      "case_study": null,
      "recommendations": [
        {
          "title": "Overview of Commercetools Products",
          "link": "https://docs.commercetools.com/offering/products-overview"
        },
        {
          "title": "Documentation",
          "link": "https://docs.commercetools.com/docs/composable-commerce"
        },
        {
          "title": "AI Assistant",
          "link": "https://docs.commercetools.com/docs/chat"
        }
      ]
    },
    {
      "id": 2,
      "title": "Dummy Session for Testing",
      "overview": "This session is a placeholder to test the functionality of the learning environment. Replace this with actual content later.",
      "infographic": "img/session2-infographic.png",
      "topics": [
        {
          "title": "Topic 1 - Placeholder",
          "description": "This is a dummy topic description for testing. Replace this with real content.",
          "infographic": "img/session2-topic1.png",
          "notes": [
            "Dummy note 1.",
            "Dummy note 2.",
            "Dummy note 3."
          ]
        },
        {
          "title": "Topic 2 - Placeholder",
          "description": "Another dummy topic description. Ensure this is updated later with real content.",
          "infographic": "img/session2-topic2.png",
          "notes": [
            "Sample point A.",
            "Sample point B.",
            "Sample point C."
          ]
        }
      ],
      "quiz": "https://moodle.example.com/quiz2",
      "case_study": null,
      "recommendations": [
        {
          "title": "Dummy Recommendation 1",
          "link": "https://example.com/recommendation1"
        },
        {
          "title": "Dummy Recommendation 2",
          "link": "https://example.com/recommendation2"
        }
      ]
    }
  ]
}
